
from flask import Flask
import random
app = Flask(__name__)
facts_list = ["Большинство людей, страдающих технологической зависимостью, испытывают сильный стресс, когда они находятся вне зоны покрытия сети или не могут использовать свои устройства.",
              "Согласно исследованию, проведенному в 2018 году, более 50% людей в возрасте от 18 до 34 лет считают себя зависимыми от своих смартфонов.",
              "Согласно исследованию, проведенному в 2019 году, более 60% людей отвечают на рабочие сообщения в своих смартфонах в течение 15 минут после того, как они вышли с работы.",
              "Илон Маск также выступает за регулирование социальных сетей и защиту личных данных пользователей. Он утверждает, что социальные сети собирают огромное количество информации о нас, которую потом можно использовать для манипулирования нашими мыслями и поведением."]
imena = ["olia" , "kirilla" , "vania" ,"vika"]
@app.route("/")
def hello_world():
   return '''
   Узнай факты такая по кнопке
 <a href="/random_fact">Посмотреть случайный факт!</a>
 <a href="/random_imena">Посмотреть случайное имя </a>
'''
@app.route("/random_fact")
def random_fact():
  return f'<p>{random.choice(facts_list)}</p>'

@app.route("/random_imena")
def random_imena():
  return f'<p>{random.choice(imena)}</p>'

app.run(debug=True)